// script.js
window.addEventListener('DOMContentLoaded', (event) => {
  const imageContainer = document.querySelector('#imageContainer');

  const images = [
    { src: 'pictures/first_date1.jpg', text: ' החוויה שלי מהדייט הראשון שלנו היא מיוחדת, אני זוכר את הדייט הראשון שלנו כמדהים. זה כלל פגישה ואזהרות מאבא שלך, פגישה עם אבא שלי באמצע הכביש באוטובוס והכי חשוב ביטלת לחברים שלך בשבילי, היה לנו חיבור מדהים מהרגע הראשון וכבר בדייט הראשון זה הרגיש לי נכון, במיוחד ברגע שלנו שנלקח מהטיטאניק' },
    { src: 'pictures/second_date1.jpg', text: '		שוב, עוד משחק שהוכחתי כמה אני טוב יותר כשאת נגדי וכשאת מוציאה לשון ליריבים שלי. שברתי את השיא שלי בבאולינג נגדך ומפתיע אותי כל פעם מחדש שלא ברחת אחרי ההפסד הזה' },
    { src: 'pictures/bowling1.jpg', text: '		שוב, עוד משחק שהוכחתי כמה אני טוב יותר כשאת נגדי וכשאת מוציאה לשון ליריבים שלי. שברתי את השיא שלי בבאולינג נגדך ומפתיע אותי כל פעם מחדש שלא ברחת אחרי ההפסד הזה' },
    { src: 'pictures/pool_game1.jpg', text: '		אין הרבה מה להגיד, כשאני משחק איתך במשחקים אני נהיה פשוט מדהים. הבסתי אותך בסנוקר למרות שהיית מתמודדת ראויה. ולמרות שכבר הייתי אמור לנצח הצעת שהמפסיד יעבור השפלה ויצבע את המצח עם גיר כחול, זה היה דייט מיוחד עם תמונות מיוחדות שקבלנו ממנו, והדבר החשוב הוא שולמדתי להכיר צדדים שונים בך ושיש לך חוש הומור מדהים' },
    { src: 'pictures/cool_glasses1.jpg', text: '		זה היה בערך פעם שנייה אחרי שהכרתי את ההורים וכבר הרגשתי בנוח להביא את המשקפיים האלו ולעשות תמונות כמו איזה שני מפגרים' },
    { src: 'pictures/kito1.jpg', text: '		פעם שנייה שלך בבית שלי רק שהפעם זה היה עם קיטו ה NPC. התחברת ברמות לאחים שלי ולמשפחה שלי מהרגע הראשון. מהשנייה שדרכת בבית שלי הפכת לחלק מהמשפחה, אין לי מה להגיד חוץ מתודה על מי שאת ומה שאת בשבילי, אני אוהב אותך♥' },
    { src: 'pictures/cake1.jpg', text: '		כמו שני מושפעים מטיקטוק החלטנו לעשות את הטרנד והכנו עוגת שוקולד שאני לא רואה ואת לא שומעת ואת מתעללת בי תוך ומצלמת את זה. אמנם העוגה שיצאה הייתה מגעילה ( ואמא שלך שחזרה מחו"ל שיקרה שהיא הייתה טעימה) אבל זאת אחת החוויות הכי מצחיקות שלנו ביחד ונהנתי ברמות כשהכנו את העוגה האזת ביחד למרות כל המכות שחטפתי ממך. איכשהו אני תמיד נגרר לטרנדים האלה איתךך' },
    { src: 'pictures/beer_sheva1.jpg', text: '		היום הראשון שלנו ביחד בחנוכה מתוך הלו"ז השלם שתכננו לעצמנו. נסענו לבאר שבע במטרה לעשות החלקה על הקרח ובסוף התבאסנו תחת כי זה ראינו שזה מתאים לילדים קטנים ( אפילו כפיר היה מתאכזב) ובמקום להתבאס מעט כמוני את היית בראש פתוח וחיפשת מה אפשר לעשות כדי להציל את המצב ולנצל את היום שלנו והלכנו לחד בריחה פסיכי (וקצת קריפי) על פסיכופת ובחזור שכנעתי אותך לראות יונתן ברקק' },
    { src: 'pictures/holon1.jpg', text: '		הייתי בשוק כשהצעת לקחת את כפיר ונועה איתנו להחלקה על הקרח אבל אני שמח שהחלטנו לקחת אותם איתנו כי אני נהנתי אתכם ברמותת. את לא מבינה אפילו כמה אני שמח שהתחברת ברמה הזאתי לאחים שלי ואני רוצה שתדעי שכשראיתי אתכם ביחד נהנים בהחלקה על הקרח פשוט חייכתי כמו מפגר מרוב אושר שהרגשתי בלב ולמרות שזה היה בשלב כלכך מוקדם בקשר ידעתי שאני מאוהב' },
    { src: 'pictures/eat1.jpg', text: '"יפה לך אוכלת"' },
    { src: 'pictures/zoo1.jpg', text: '		היה מדהים בירושלים, את זוכרת איזה מצחיק היה כשניסית לחקות חסידה על רגל אחת, כששלחתי לנועה סרטונים שהיא קוף כל פעם שראיתי אחד, שהיינו היחידם שהשתתפו בתחרות של הזאתי מהגן חיות ועשינו ריקוד חיזור נדיר או בכלל שקניתי לנו שני קופים במחיר מופקע רק כי אני אוהב אותך ואת מזרימה אותי לשטויות. בנוסף מניאק אחד עקץ אותנו עם מסטיקים יבשים במחיר מופקע ואכלנו קוראסון אסאדו נדיר ביחד. ' },
    { src: 'pictures/sleep1.jpg', text: '		זוכרת שהחלפתי לך את הרקע בטלפון וקיבלת הפתעה על הבוקר עם קולאז שלך ישנה?? \n אז אל תשכחי שיש לי מאגר שלם של תמונות שלך ישנה ותמיד שאני רואה אותן זה מזכיר לי שאת הילדה הכי יפה שיש בעולם הזה ואני מודה לאלוהים כל יום שזכיתי בך' },
    { src: 'pictures/spot1.jpg', text: '		הספוט שלנו, המקום המועדף עלינו, זה המקום שאנחנו מוצאים בו שקט ואנחנו נהנים אחד מהשני בלי שום הפרעות ורעש מסביב, כשאנחנו בספוט שלנו אני נהנה מהדברים הקטנים, אני נהנה לראות אותך צוחקת, אני נהנה מהחיוך היפה שלך וגם מהעיניים הבוהקות שלך שאת מדברת בהתלהבות על משהו, גם כשנזדקן ביחד, זה תמיד יהיה הספוט שלנו♥ ' },
    { src: 'pictures/valentines1.jpg', text: '		הולנטיין ראשון שלנו בתור זוג ואני נמצא בברצלונה במרחק של 3100  ק"מ ממך ואני סופסוף מגשים את החלום שלי להיות במשחק בברצלונה ועדיין כל מה שמעסיק לי את הראש זאת את, אז החלטתי לשלוח לך פרחים לבית כדי להראות לך כמה שאני חושב עלייך וזה המעטו שיכולתי לעשות ביום הזה כדי להראות לך כמה שאת חשובה לי וכמה שאני אוהב אותך♥' },
    { src: 'pictures/rich_couple1.jpg', text: '		היה מהנה מאוד ללכת ביחד איתך ועם המשפחה שלך למימונה של טחונים שבה הרגשנו כאילו אנחנו זוג של עשירים מהעשירון העליון, למרות שבתכלס אנחנו פשוטי עם כאלה כמו כולם' },
    { src: 'pictures/family_trip1.jpg', text: '		מאז שהכרתי אותך תמיד שמעתי מלא סיפורים על כל הטיולים שהיה לך בארץ ובחו"ל ותמיד שמחתי בשבילך על כל החוויות שצברת ואנ ישמח שניתנה לי את ההזדמנות בפעם הראשונה להצטרף לטיול ביחד עם המשפחה שלך ולחוות את מה שאת חווה כבר מאז שאת ילדה קטנה. הטיול היה מדהים מבחינתי ונהנתי בכל שנייה ביחד אתכם ואני שמח שאני כבר הופך להיות חלק מהמשפחה שלך שאני כלכך אוהב♥' },
    { src: 'pictures/greece1.jpg', text: '		אני לא יודע מאיפה להתחיל, הטיול ליוון הייתה אחת החוויות הכי מעצימות ומגשבות שלנו ביחד, למדתי להכיר אותך מבפנים ומבחוץ ברמות שלא הכרתי מלפני והערצה שלי כלפייך רק התעצמה. גיליתי על העוצמות שלך ועל הגישה החיובית שלך לסיטואציות בחיים שלך ואני חושב ש...<a href="greece.html">להמשך הכתבה לחץ על הלינק</a>' },
    { src: 'pictures/sea1.jpg', text: '		תמיד אנחנו נהנים ביחד בים, תמיד כיף לנו שאחד לבן ורק נשרף, לעומתף שאת מאז יוון תופסת יותר ויותר צבע. הים הוא המקום המועדף עלינו ביחד. בין אם זה חוף גיל, האבנים בקשתות, הספוט הקבוע שלנו או פשוט ים בשישי ביחד, כשאני איתך בים אני מרגיש רגוע ושליו, אני נהנה ננל ומהרוגע והשלווה בים ואני מרגיש שיש לי כל מה שאני צריך בחיים שלי' },
    { src: 'pictures/rollups1.jpg', text: '		אחרי מסע חיפושים ארוך מאוד השגנו רולאפס וטעמנו אותו עם גלידהה. הפעם הראשנה היה פחות טעים אבל בפעם השנייה עם הגלידה מסטיק הוא היה מדהים' },
    { src: 'pictures/graduated1.jpg', text: '		נסיכה שלי, גאווה שלי, אין לי מילים להגיד לך כמה אני גאה בך שסיימת את הלימודים בהצלחה. אני לא יכול לחכות להמשך הדרך שלנו ביחד ולראות לאן את תתפתחי ותתקדמי, יש לך יכולות פנומנליות ואני בטוח שתמצאי את המקום שתבואי בו לידי ביטוי בצורה הטובה ביותר. תזכרי שכל דבר שתבחרי לעשות אני אעמוד מאחוריך ואתן לך את התמיכה המלאה שלי, אני אוהב אותך וגאה בך♥' },
    { src: 'pictures/trip_with_friends1.jpg', text: '		הטיול זוגות שלנו עם קורן ושירז (שלא מוגדרים כזוג) היה טיול שצברנו בו הרבה חוויות ביחד, אני שמח מאוד שאת מצליחה להתחבר לחברים שלי ולמצוא איתם שפה משותפת, אני גאה בך ברמות ששברת את המחסום הפסיכולוגי שלך באותו היום וקפצת מהאבנים לתוך המים כמו ילדה גיבורה. אני מאחל לנו עוד הרבה טיולים ביחד כזוג, עם חברים וגם עם אבא שלך ( שהיה מעורב גם בטיול הזה)' },
    { src: 'pictures/seven_month1.jpg', text: 'נסיכה שלי, את זוכרת את השבעה חודשים שלנו? עשינו פקניק עם פסטה נדירה שהכנו בעצמנו בפארק לכיש, ישבנו מול הנחל עם המים הזורמים וסכמנו את שבעת החודשים שלנו, תאמנו ציפיות לעתיד המשותף שלנו ביחד ועשינו פינקי פרומס מחודש. אבל הדבר הכי טוב שעשינו היה הציור שלנו , הוא מסמל לי שאני ואת לנצח ואת הציור הזה אני ארצה להראות לילדים שלנו בעזרת השם' },
    { src: 'pictures/asaf_injured1.jpg', text: '		כן אני פצוע, שוב. יש מצב שבזמן שאת קוראת את זה אני שוב חולה/פצוע/בניתוח/לא רואה בעין שמאל או סתם עם כאבים בברכיים. דווקא בסיטואציות האלה, והשיא שלהן היה כשחטפתי ספריי שלג לעין ולא ראיתי בעין שמאל, ראיתי כמה את דואגת לי וכמה את מוכנה להקריב בשבילי ולתת ממך בשבילי. אבל זה לא רק ברגע...<a href="asaf_ingured.html">להמשך הכתבה לחץ על הלינק</a>' },
    { src: 'pictures/elevetor1.jpg', text: '		זה אמנם היה יום רגיל, לא היה בו משהו מיוחד. אני ואת הלכנו סך הכל לקניות בסופר אבל כלכך נהנתי איתך גם ביום הזה. למרות שלא עשינו שום דבר מיוחד פשוט צחקנו בלי הפסקה. ביום הזה  למדתי שכשאנחנו ביחד אנחנו יכולים להנות מכל דבר כל עוד אנחנו אחד עם השני וזה מעיד לי הרבה על המשך החיים שלנו ביחד, שגם בדברים המשעממים , תמיד נדע להנות אחד מהשני ואחד בזכות השני.' },
    { src: 'pictures/princess1.jpg', text: '		סתם תזכורת לזה שאני אוהב אותך נסיכה קטנה שלי♥♥' },
    { src: 'pictures/purim1.jpg', text: '		אני מאוד אהבתי את פורים שלנו ביחד, בפורים הלכנו למסיבה הראשונה שלנו ביחד וכמו כל זוג קיטשיים עשינו תחפושת זוגית (מדהימה יש לציין) של רטטויי שקבלנו עליה מלא מחמאות ואפילו ראינו את הסרט לפני כדי להכנס לדמות עד הסוף. נהנתי ברמות במסיבה הראשונה שלנו ביחד ואני מאחל לנו שנמשיך ללכת לעוד מלא מסיבות ביחד ולהנות ככה אחד מהשני' },
    { src: 'pictures/rondo1.jpg', text: '		הרונדו שלנו היה מאוד מעניין, הוא התחיל מדבים אצל כל אחד במקיף שלו וההי עוד יותר טוב כשנפגשנו עד הרגע שבו הוא החל טיפה להדרדר בעקבות העין שלי, ואת ,למרות שרצית להמשיך להנות עם החברים ולהנות וגם ללכת לאפטר רונדו החלטת לוותר על כל זה בשביל לבוא איתי ולתמוך בי ואת לא מסינה אפילו כמה אני מעריך את מה שעשית ואת העובדה שבשבילך זה מובן מאליו כמו שזה מובן מאליו בשבילי' },
    { src: 'pictures/first_time1.jpg', text: '		אין מה להגיד גם בזה אנחנו מדהימים. אני כלכך שמח שאת הפעם הראשונה שלי זכיתי לעשות איתך ואני כלכך שמח שלא חיכינו ליום השלישי ביוון ובמיוחד שלא חיכינו לנשף שלך. החיבור שלנו במיטה מדהים כמו שהחיבור שלנו בחיים מדהים. אני חושב שכל המלון כבר שמע שמועות על החדר שלנו מכמות המצעים שהחלפנו אבל זה פשוט היה שווה את זה. אני אוהב אותך נסיכה שליי♥' },
    { src: 'pictures/katan1.jpg', text: '		אין מה להגיד, נכנסת למשפחה מאודד תחרותית שתמיד רוצה לנצח בהכל וכתוצאה מכך היו לנו המון משחקי קטאן אמויונאליים עם הרבה מאוד רגשות וקצת עצבים וירידה לפסים אישיים (נועם לא גיי אהמ אהמ, אבל הדברים האלה גם עושים אותך מיוחדת) אבל עדיין אני מקווה שלעולם לא נפסיק עם המשחק הזה ואני שמח על מסורת הקטאן החדשה שיצרנו עם במשפחה' },
    { src: 'pictures/first_month.jpg', text: '		זוכרת את המתנה הראשונה שהבאתי לך? אני יודע שעבר הרבה מאוד זמן מאז אבל תמיד כיף להזכר ברגעים אחורה? אני נהנתי להכין את המתנה אותה כי ידעתי שאת הולכת לאהוב אותה והתחושה הזאת נתנה לי את הדרייב לעשות את זה. אני זוכר שאת לא חשבת שמביאים מתנה אחרי חודש אבל לא הייתי צריך ממך שום מתנה בגלל שאת המתנה שלי,. כשיש לי אותך אני לא צריך יותר כלום' },
    // Add more image URLs and corresponding text here
  ];

  // Create image elements and append them to the container
  images.forEach((image) => {
    const imgElement = document.createElement('img');
    imgElement.src = image.src;
    imgElement.alt = 'Gallery Image';
    imgElement.classList.add('gallery-image');

    // Wrap the image and text overlay in a container
    const imageContainer = document.createElement('div');
    imageContainer.classList.add('image-container');
    imageContainer.appendChild(imgElement);

    imageContainer.onclick = function () {
      modal.style.display = "block";
      console.log(image.src)
      modalImage.src = image.src;
      modalText.innerHTML = image.text
    }

    document.querySelector('#imageContainer').appendChild(imageContainer);
  });
});

// Get the modal
var modal = document.getElementById("myModal");
var modalImage = document.getElementById("modalImage");
var modalText = document.getElementById("modalText");


// Get the <span> element that closes the modal
var span = document.getElementsByClassName("close")[0];


// When the user clicks on <span> (x), close the modal
span.onclick = function () {
  modal.style.display = "none";
}

// When the user clicks anywhere outside of the modal, close it
window.onclick = function (event) {
  if (event.target == modal) {
    modal.style.display = "none";
  }
}